app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Rails is not so awesome!"], ["updated_at", 2016-12-07 21:32:40 UTC], ["id", 2]]
---
	def update
		@article = Article.find(params[:id])

		if @article.update(article_params)